In [5]:
import pandas as pd

df_raw = pd.read_csv("data.csv")
print(df_raw.head())

   ID   Name  Age  Gender  MathScore  EnglishScore  Score       Address  \
0   1   John   25    Male         80            90   85.0   123 Main St
1   2  Alice   30  Female         70            85   77.5    456 Elm St
2   3    Bob   22    Male         60            75   67.5    789 Oak St
3   4    Eve   28  Female         55            95   75.0   101 Pine St
4   5  Chris   24    Male         90            80   85.0  111 Maple St

        Full_Name  Subject        Date
0        John Doe     Math  2023-08-01
1     Alice Smith  English  2023-08-02
2  Robert Johnson     Math  2023-08-01
3    Eve Williams  English  2023-08-03
4     Chris Brown     Math  2023-08-02

In [7]:
df = df_raw.copy() 
df

,ID,Name,Age,Gender,MathScore,EnglishScore,Score,Address,Full_Name,Subject,Date
0,1,John,25,Male,80,90,85.0,123 Main St,John Doe,Math,2023-08-01
1,2,Alice,30,Female,70,85,77.5,456 Elm St,Alice Smith,English,2023-08-02
2,3,Bob,22,Male,60,75,67.5,789 Oak St,Robert Johnson,Math,2023-08-01
3,4,Eve,28,Female,55,95,75.0,101 Pine St,Eve Williams,English,2023-08-03
4,5,Chris,24,Male,90,80,85.0,111 Maple St,Chris Brown,Math,2023-08-02

In [8]:
age_column = df['Age']
print(age_column.head(10))

0    25
1    30
2    22
3    28
4    24
Name: Age, dtype: int64

In [9]:
data_1 = df[(df['Gender']== 'Female') & (df['Age'] > 25)]
print(data_1)

   ID   Name  Age  Gender  MathScore  EnglishScore  Score      Address  \
1   2  Alice   30  Female         70            85   77.5   456 Elm St
3   4    Eve   28  Female         55            95   75.0  101 Pine St

      Full_Name  Subject        Date
1   Alice Smith  English  2023-08-02
3  Eve Williams  English  2023-08-03

In [10]:
score_sum =  df['Score'].sum()
print(score_sum)

390.0

In [11]:
df['TotalScore'] = df['MathScore'] + df['EnglishScore'] # THEM COT MOI
df.head()

,ID,Name,Age,Gender,MathScore,EnglishScore,Score,Address,Full_Name,Subject,Date,TotalScore
0,1,John,25,Male,80,90,85.0,123 Main St,John Doe,Math,2023-08-01,170
1,2,Alice,30,Female,70,85,77.5,456 Elm St,Alice Smith,English,2023-08-02,155
2,3,Bob,22,Male,60,75,67.5,789 Oak St,Robert Johnson,Math,2023-08-01,135
3,4,Eve,28,Female,55,95,75.0,101 Pine St,Eve Williams,English,2023-08-03,150
4,5,Chris,24,Male,90,80,85.0,111 Maple St,Chris Brown,Math,2023-08-02,170

In [12]:
sorted_df  = df.sort_values(by='Age', ascending=True)
print(sorted_df.head())

   ID   Name  Age  Gender  MathScore  EnglishScore  Score       Address  \
2   3    Bob   22    Male         60            75   67.5    789 Oak St
4   5  Chris   24    Male         90            80   85.0  111 Maple St
0   1   John   25    Male         80            90   85.0   123 Main St
3   4    Eve   28  Female         55            95   75.0   101 Pine St
1   2  Alice   30  Female         70            85   77.5    456 Elm St

        Full_Name  Subject        Date  TotalScore
2  Robert Johnson     Math  2023-08-01         135
4     Chris Brown     Math  2023-08-02         170
0        John Doe     Math  2023-08-01         170
3    Eve Williams  English  2023-08-03         150
1     Alice Smith  English  2023-08-02         155

In [14]:
grouped_data = df.groupby('Gender')['Age'].mean()
print(grouped_data)

Gender
Female    29.000000
Male      23.666667
Name: Age, dtype: float64

In [15]:
df = df.drop_duplicates() # xoa du lieu trung
print(df)

   ID   Name  Age  Gender  MathScore  EnglishScore  Score       Address  \
0   1   John   25    Male         80            90   85.0   123 Main St
1   2  Alice   30  Female         70            85   77.5    456 Elm St
2   3    Bob   22    Male         60            75   67.5    789 Oak St
3   4    Eve   28  Female         55            95   75.0   101 Pine St
4   5  Chris   24    Male         90            80   85.0  111 Maple St

        Full_Name  Subject        Date  TotalScore
0        John Doe     Math  2023-08-01         170
1     Alice Smith  English  2023-08-02         155
2  Robert Johnson     Math  2023-08-01         135
3    Eve Williams  English  2023-08-03         150
4     Chris Brown     Math  2023-08-02         170

In [16]:
a_age = df['Age'].mean()
df['Age'].fillna(a_age, inplace=True)
print(df)

   ID   Name  Age  Gender  MathScore  EnglishScore  Score       Address  \
0   1   John   25    Male         80            90   85.0   123 Main St
1   2  Alice   30  Female         70            85   77.5    456 Elm St
2   3    Bob   22    Male         60            75   67.5    789 Oak St
3   4    Eve   28  Female         55            95   75.0   101 Pine St
4   5  Chris   24    Male         90            80   85.0  111 Maple St

        Full_Name  Subject        Date  TotalScore
0        John Doe     Math  2023-08-01         170
1     Alice Smith  English  2023-08-02         155
2  Robert Johnson     Math  2023-08-01         135
3    Eve Williams  English  2023-08-03         150
4     Chris Brown     Math  2023-08-02         170

In [ ]:
score_descrip = df['Score'].describe()
print(score_descrip)